from fastapi import APIRouter, Request, status
from fastapi.responses import JSONResponse
import pandas as pd
from services import F2

f2_route = APIRouter(prefix="/reports")

@f2_route.get("/f2")
async def get_f2_reports(req: Request):
    df_report: pd.DataFrame = getattr(req.app.state, "df_report", None)
    if df_report is None:
        return JSONResponse(
            content={"error": "No report available. Please upload the file first"},
            status_code=status.HTTP_404_NOT_FOUND,
        )

    f2 = F2(df_report)

    try:
        f2_report1 = f2.first_report()   
        total = f2_report1['total'] 
        report_1 = f2_report1['report_1']  
        report_3 = f2_report1['report_3']  

        f2_report2 = f2.second_report()   
        total_2 = f2_report2['total'] 
        report_2_1 = f2_report2['report_1']  
        report_2_2 = f2_report2['report_2']  

        f2_report5 = f2.fifth_report()
        total_5 = f2_report5['total']   
        report_5_1 = f2_report5['report_1']  
        report_5_2 = f2_report5['report_2']  
        report_5_4 = f2_report5['report_4']  

        f2_report8 = f2.eighth_report()
        total_8 = f2_report8['total']   
        report_8_2 = f2_report8['report_2']  
        report_8_3 = f2_report8['report_3']  

        f2_report10 = f2.tenth_report()
        total_10 = f2_report10['total']   
        report_10_1 = f2_report10['report_1']  
        report_10_3 = f2_report10['report_3']  \
        
        f2_report11 = f2.eleventh_report()
        total_11 = f2_report11['total']   
        report_11_3 = f2_report11['report_3']  

        f2_report12 = f2.twelfth_report()
        total_12 = f2_report12['total']   
        report_12_1 = f2_report12['report_1']  
        report_12_2 = f2_report12['report_2']  

        f2_report15 = f2.fifteenth_report()
        total_15 = f2_report15['total']   
        report_15_1 = f2_report15['report_1']  

        f2_report16 = f2.sixteenth_report()
        total_16 = f2_report16['total']   
        report_16_1 = f2_report16['report_1']  
        report_16_3 = f2_report16['report_3']  
        report_16_4 = f2_report16['report_4']  
        report_16_5 = f2_report16['report_5']  
        report_16_9 = f2_report16['report_9']  
        report_16_11 = f2_report16['report_11']  
        
        response_data = {
            #"index": list(range(0 , 78)),
            "columns": ["ລາຍການ", "ຈໍານວນເງິນ (ກີບ)"],  
            "data": [
                ["1. ເງິນສົດ ແລະ ເງິນຝາກຢູ່ທະນາຄານກາງ", total],
                ["1.1 ເງິນສົດ ແລະ ທີ່ຖືວ່າຄືເງິນສົດ",report_1],
                ["1.2 ເງິນຝາກບໍ່ມີກຳນົດ", 0 ],
                ["1.3 ເງິນຝາກມີກຳນົດ", report_3],

                ["2. ໜີ້ຕ້ອງຮັບຈາກສະຖາບັນການເງິນອື່ນ", total_2],
                ["2.1 ເງິນຝາກບໍ່ມີກຳນົດ",report_2_1],
                ["2.2 ເງິນຝາກມີກຳນົດ", report_2_2 ],
                ["2.3 ເງິນໃຫ້ກູ້ຢືມ ແລະ ເງິນລ່ວງໜ້າສຸດທິ",0],

                ["3. ຫຼັກຊັບຊື້ໂດຍມີສັນຍາຂາຍຄືນ",0],
                ["3.1 ຫຼັກຊັບຊື້ໂດຍມີສັນຍາຂາຍຄືນ",0],
                ["3.2 ໜີ້ຕ້ອງຮັບທວງຍາກ ແລະ ລາຍການອື່ນໆ",0],

                ["4. ເງິນລົງທຶນໃນຫຼັກຊັບສຸດທິ",0],
                ["4.1 ຫຼັກຊັບເພື່ອຄ້າ",0],
                ["4.2 ຫຼັກຊັບຊື້ເພື່ອຂາຍ",0],
                ["4.3 ຫຼັກຊັບລົງທຶນ",0],      

                ["5. ສິນເຊື່ອ ແລະ ເງິນລ່ວງໜ້າໃຫ້ລູກຄ້າສຸດທິ", total_5],
                ["5.1 ໜີ້ປົກກະຕິ",report_5_1],
                ["5.2 ໜີ້ຄວນເອົາໃຈໃສ່", report_5_2 ],
                ["5.3 ໜີ້ທວງຍາກຈາກລູກຄ້າ",0],  
                ["5.4 ເງິນແຮຄ່າເຊື່ອມໜີ້ທວງຍາກ",report_5_4],

                ["6. ເງິນລົງທຶນໃນວິສາຫະກິດໃນກຸ່ມ, ບໍລິສັດຮ່ວມທຶນ ແລະ ກິດຈະການຄຸ້ມຄອງຫຼັກຊັບ",0],
                ["6.1 ເງິນລົງທຶນໃນທຸລະກິດໃນກຸ່ມ",0],
                ["6.2 ເງິນແຮຄ່າເຊື່ອມຂອງເງິນລົງທຶນ",0],
                ["6.3 ເງິນລົງທຶນຮ່ວມຂອງວິສາຫະກິດໃນກຸ່ມ ແລະ ຫຼັກຊັບໃນກິດຈະການຄຸ້ມຄອງຫຼັກຊັບ",0],
                ["6.4 ເງິນແຮຄ່າເຊື່ອມການລົງທຶນຂອງວິສາຫະກິດໃນກຸ່ມ ແລະ ຫຼັກຊັບ",0],

                ["7. ສິນເຊື່ອເຊົ່າ-ຊື້ ແລະ ໃຫ້ເຊົ່າການເງິນ",0],
                ["7.1 ສິນເຊື່ອເຊົ່າຊື້ ແລະ ກິດຈະກໍາປະເພດດຽວກັນ",0],
                ["7.2 ຄ່າຫຼຸ້ຍຫ້ຽນສະສົມ ຊັບສົມບັດຄົງທີ່ໃຫ້ເຊົ່າຊື້ ແລະ ກິດຈະກໍາປະເພດດຽວກັນ",0],
                ["7.3 ເງິນແຮຄ່າເຊື່ອມມູນຄ່າ ຊັບສົມບັດຄົງທີ່ໃຫ້ເຊົ່າຊື້ ແລະ ກິດຈະກໍາປະເພດດຽວກັນ",0],
                ["7.4 ຊັບສົມບັດຄົງທີ່ໃຫ້ເຊົ່າທໍາມະດາ",0],
                ["7.5 ຄ່າຫຼຸ້ຍຫ້ຽນສະສົມ ຊັບສົມບັດຄົງທີ່ໃຫ້ເຊົ່າທໍາມະດາ",0],
                ["7.6 ເງິນແຮຄ່າເຊື່ອມມູນຄ່າ ຊັບສົມບັດຄົງທີ່ໃຫ້ເຊົ່າທໍາມະດາ",0],
                ["7.7 ໜີ້ຕ້ອງຮັບທວງຍາກ",0],
                ["7.8 ເງິນແຮຄ່າເຊື່ອມມູນຄ່າໜີ້ຕ້ອງຮັບທວງຍາກ",0],

                ["8. ຊັບສົມບັດຄົງທີ່ສຸດທິ", total_8],
                ["8.1 ຊ.ຄ.ທ ພວມຊື້ ແລະ ພວມກໍ່ສ້າງ",0],
                ["8.2 ຊ.ຄ.ທ ບໍ່ມີຕົວຕົນ", report_8_2 ],
                ["8.3 ຊ.ຄ.ທ ມີຕົວຕົນ",report_8_3],

                ["9.ທຶນຈົດທະບຽນບໍ່ທັນໄດ້ຖອກ",0],
                ["9.1 ຜູ້ຖືຮຸ້ນ",0],

                ["10. ຊັບສິນອື່ນໆ" , total_10],
                ["10.1 ດອກເບ້ຍ ແລະ ລາຍຮັບອື່ນໆຄ້າງຮັບ" , report_10_1],
                ["10.2 ບັນຊີລະຫວ່າງສຳນັກງານໃຫຍ່ກັບສາຂາ" , 0],
                ["10.3 ອື່ນໆ" , report_10_3],

                [ "11. ໜີ້ຕ້ອງສົ່ງໃຫ້ທະນາຄານ ແລະ ສະຖາບັນການເງິນອື່ນ" , total_11],
                [ "11.1  ເງິນຮັບຝາກບໍ່ມີກຳນົດ" , 0],
                [ "11.2 ເງິນຮັບຝາກມີກຳນົດ" , 0],
                [ "11.3 ເງິນກູ້ຢືມ" , report_11_3],
                [ "11.4 ໜີ້ຕ້ອງສົ່ງອື່ນໆໃຫ້ທະນາຄານ ແລະ ສະຖາບັນການເງິນອື່ນ" , 0],

                [ "12. ໜີ້ຕ້ອງສົ່ງໃຫ້ລູກຄ້າ" , total_12],
                [ "12.1 ເງິນຮັບຝາກບໍ່ມີກຳນົດ" , report_12_1],
                [ "12.2 ເງິນຮັບຝາກມີກຳນົດ" , report_12_2],
                [ "12.3 ໜີ້ຕ້ອງສົ່ງອື່ນໆໃຫ້ລູກຄ້າ" , 0],

                ["13. ຫຼັກຊັບຂາຍໂດຍມີສັນຍາຊື້ຄືນ", 0],
                ["13.1 ຫຼັກຊັບຂາຍໂດຍມີສັນຍາຊື້ຄືນ", 0],

                ["14. ໜີ້ຕ້ອງສົ່ງທີ່ກຳເນີດຈາກການຈຳໜ່າຍຫຼັກຊັບ", 0],
                ["14.1 ເອກະສານຢັ້ງຢືນການກູ້ຢືມເງິນ", 0],
                ["14.2 ພັນທະບັດ ຫຼື ເງິນກູ້ທີ່ໄດ້ຈໍາໜ່າຍອອກ", 0],

                ["15. ໜີ້ສິນອື່ນໆ", total_15],
                ["15.1 ດອກເບ້ຍ ແລະ ລາຍຈ່າຍອື່ນໆຄ້າງຈ່າຍ",report_15_1],
                ["15.2 ບັນຊີພົວພັນລະຫວ່າງສຳນັກງານໃຫຍ່ກັບສາຂາ" , 0],
                ["15.3 ອື່ນໆ" , 0],

                ["16. ທຶນ ແລະ ຖືວ່າເປັນທຶນຂອງສະຖາບັນການເງິນ", total_16],
                ["16.1 ທຶນຈົດທະບຽນ", report_16_1],
                ["16.2 ສ່ວນເພີ່ມມູນຄ່າຮຸ້ນ", 0],
                ["16.3 ຄັງສຳຮອງຕາມກົດໝາຍ", report_16_3],
                ["16.4 ຄັງຂະຫຍາຍທຸລະກິດສະຖາບັນການເງິນ", report_16_4],
                ["16.5 ຄັງສຳຮອງອື່ນໆ", report_16_5],
                ["16.6 ສ່ວນຜິດດ່ຽງຈາກການຕີມູນຄ່າຄືນໃໝ່", 0],
                ["16.7 ເງິນແຮຕາມຂໍ້ກຳນົດ (ເງິນແຮ່ຄ່າເຊື່ອມເງິນກູ້ປົກກະຕິ)", 0],
                ["16.8 ກຳໄລ-ຂາດທຶນສະສົມ (+/-)", 0],
                ["16.9 ຜົນໄດ້ຮັບລໍຖ້າຮັບຮອງ (+/-)", report_16_9],
                ["16.10 ຜົນໄດ້ຮັບໃນປີ (+/-)", 0],
                ["16.11 ເງິນທຶນຊ່ວຍໜູນ ແລະ ທຶນທີ່ໄດ້ຈັດສັນ", report_16_11],
                ["16.12 ໜີ້ຕ້ອງສົ່ງສຳຮອງ", 0],
                ["16.13 ເງິນຮຸ້ນສະມາຊິກຂອງ ສສງ", 0],
            ]
        }

        return JSONResponse(content=response_data)

    except Exception as e:
        print("Error occurred:", str(e))  # Log the error message
        return JSONResponse(
            content={"error": "An internal error occurred", "details": str(e)},
            status_code=status.HTTP_500_INTERNAL_SERVER_ERROR
        )
