from fastapi import APIRouter, Request, status
from fastapi.responses import JSONResponse
import pandas as pd
from services import F2
from utils import response_message

f2_route = APIRouter(prefix="/reports")


@f2_route.get("/f2")
async def get_f2_reports(req: Request):
    df_report: pd.DataFrame = getattr(req.app.state, "df_report", None)
    if df_report is None:
        return JSONResponse(
            content=response_message(
                message="No report available. Please upload the file first.",
                success=False,
            ),
            status_code=status.HTTP_404_NOT_FOUND,
        )

    f2 = F2(df_report)

    try:
        report1 = f2.first_report()

        report2 = f2.second_report()

        report5 = f2.fifth_report()

        report8 = f2.eighth_report()

        report10 = f2.tenth_report()

        report11 = f2.eleventh_report()

        report12 = f2.twelfth_report()

        report15 = f2.fifteenth_report()

        report16 = f2.sixteenth_report()

        assest_liability = f2.asset_and_liability()

        response_data = {
            "index": list(range(0, 78)),
            "columns": ["Item", "Amount (KIP)"],
            "data": [
                ["1. ເງິນສົດ ແລະ ເງິນຝາກຢູ່ທະນາຄານກາງ", report1["total"]],
                ["1.1 ເງິນສົດ ແລະ ທີ່ຖືວ່າຄືເງິນສົດ", report1["report_1"]],
                ["1.2 ເງິນຝາກບໍ່ມີກຳນົດ", 0],
                ["1.3 ເງິນຝາກມີກຳນົດ", report1["report_3"]],
                ["2. ໜີ້ຕ້ອງຮັບຈາກສະຖາບັນການເງິນອື່ນ", report2["total"]],
                ["2.1 ເງິນຝາກບໍ່ມີກຳນົດ", report2["report_1"]],
                ["2.2 ເງິນຝາກມີກຳນົດ", report2["report_2"]],
                ["2.3 ເງິນໃຫ້ກູ້ຢືມ ແລະ ເງິນລ່ວງໜ້າສຸດທິ", 0],
                ["3. ຫຼັກຊັບຊື້ໂດຍມີສັນຍາຂາຍຄືນ", 0],
                ["3.1 ຫຼັກຊັບຊື້ໂດຍມີສັນຍາຂາຍຄືນ", 0],
                ["3.2 ໜີ້ຕ້ອງຮັບທວງຍາກ ແລະ ລາຍການອື່ນໆ", 0],
                ["4. ເງິນລົງທຶນໃນຫຼັກຊັບສຸດທິ", 0],
                ["4.1 ຫຼັກຊັບເພື່ອຄ້າ", 0],
                ["4.2 ຫຼັກຊັບຊື້ເພື່ອຂາຍ", 0],
                ["4.3 ຫຼັກຊັບລົງທຶນ", 0],
                ["5. ສິນເຊື່ອ ແລະ ເງິນລ່ວງໜ້າໃຫ້ລູກຄ້າສຸດທິ", report5["total"]],
                ["5.1 ໜີ້ປົກກະຕິ", report5["report_1"]],
                ["5.2 ໜີ້ຄວນເອົາໃຈໃສ່", report5["report_2"]],
                ["5.3 ໜີ້ທວງຍາກຈາກລູກຄ້າ", 0],
                ["5.4 ເງິນແຮຄ່າເຊື່ອມໜີ້ທວງຍາກ", report5["report_4"]],
                ["6. ເງິນລົງທຶນໃນວິສາຫະກິດໃນກຸ່ມ, ບໍລິສັດຮ່ວມທຶນ ແລະ ກິດຈະການຄຸ້ມຄອງຫຼັກຊັບ", 0],
                ["6.1 ເງິນລົງທຶນໃນທຸລະກິດໃນກຸ່ມ", 0],
                ["6.2 ເງິນແຮຄ່າເຊື່ອມຂອງເງິນລົງທຶນ", 0],
                ["6.3 ເງິນລົງທຶນຮ່ວມຂອງວິສາຫະກິດໃນກຸ່ມ ແລະ ຫຼັກຊັບໃນກິດຈະການຄຸ້ມຄອງຫຼັກຊັບ", 0],
                ["6.4 ເງິນແຮຄ່າເຊື່ອມການລົງທຶນຂອງວິສາຫະກິດໃນກຸ່ມ ແລະ ຫຼັກຊັບ", 0],
                ["7. ສິນເຊື່ອເຊົ່າ-ຊື້ ແລະ ໃຫ້ເຊົ່າການເງິນ", 0],
                ["7.1 ສິນເຊື່ອເຊົ່າຊື້ ແລະ ກິດຈະກໍາປະເພດດຽວກັນ", 0],
                ["7.2 ຄ່າຫຼຸ້ຍຫ້ຽນສະສົມ ຊັບສົມບັດຄົງທີ່ໃຫ້ເຊົ່າຊື້ ແລະ ກິດຈະກໍາປະເພດດຽວກັນ", 0],
                ["7.3 ເງິນແຮຄ່າເຊື່ອມມູນຄ່າ ຊັບສົມບັດຄົງທີ່ໃຫ້ເຊົ່າຊື້ ແລະ ກິດຈະກໍາປະເພດດຽວກັນ", 0],
                ["7.4 ຊັບສົມບັດຄົງທີ່ໃຫ້ເຊົ່າທໍາມະດາ", 0],
                ["7.5 ຄ່າຫຼຸ້ຍຫ້ຽນສະສົມ ຊັບສົມບັດຄົງທີ່ໃຫ້ເຊົ່າທໍາມະດາ", 0],
                ["7.6 ເງິນແຮຄ່າເຊື່ອມມູນຄ່າ ຊັບສົມບັດຄົງທີ່ໃຫ້ເຊົ່າທໍາມະດາ", 0],
                ["7.7 ໜີ້ຕ້ອງຮັບທວງຍາກ", 0],
                ["7.8 ເງິນແຮຄ່າເຊື່ອມມູນຄ່າໜີ້ຕ້ອງຮັບທວງຍາກ", 0],
                ["8. ຊັບສົມບັດຄົງທີ່ສຸດທິ", report8["total"]],
                ["8.1 ຊ.ຄ.ທ ພວມຊື້ ແລະ ພວມກໍ່ສ້າງ", 0],
                ["8.2 ຊ.ຄ.ທ ບໍ່ມີຕົວຕົນ", report8["report_2"]],
                ["8.3 ຊ.ຄ.ທ ມີຕົວຕົນ", report8["report_3"]],
                ["9.ທຶນຈົດທະບຽນບໍ່ທັນໄດ້ຖອກ", 0],
                ["9.1 ຜູ້ຖືຮຸ້ນ", 0],
                ["10. ຊັບສິນອື່ນໆ", report10["total"]],
                ["10.1 ດອກເບ້ຍ ແລະ ລາຍຮັບອື່ນໆຄ້າງຮັບ", report10["report_1"]],
                ["10.2 ບັນຊີລະຫວ່າງສຳນັກງານໃຫຍ່ກັບສາຂາ", 0],
                ["10.3 ອື່ນໆ", report10["report_3"]],
                [
                    "I. ຊັບສິນທັງໝົດ = (1+2+3+4+5+6+7+8+9+10)",
                    assest_liability["total_asset"],
                ],
                ["11. ໜີ້ຕ້ອງສົ່ງໃຫ້ທະນາຄານ ແລະ ສະຖາບັນການເງິນອື່ນ", report11["total"]],
                ["11.1  ເງິນຮັບຝາກບໍ່ມີກຳນົດ", 0],
                ["11.2 ເງິນຮັບຝາກມີກຳນົດ", 0],
                ["11.3 ເງິນກູ້ຢືມ", report11["report_3"]],
                ["11.4 ໜີ້ຕ້ອງສົ່ງອື່ນໆໃຫ້ທະນາຄານ ແລະ ສະຖາບັນການເງິນອື່ນ", 0],
                ["12. ໜີ້ຕ້ອງສົ່ງໃຫ້ລູກຄ້າ", report12["total"]],
                ["12.1 ເງິນຮັບຝາກບໍ່ມີກຳນົດ", report12["report_1"]],
                ["12.2 ເງິນຮັບຝາກມີກຳນົດ", report12["report_2"]],
                ["12.3 ໜີ້ຕ້ອງສົ່ງອື່ນໆໃຫ້ລູກຄ້າ", 0],
                ["13. ຫຼັກຊັບຂາຍໂດຍມີສັນຍາຊື້ຄືນ", 0],
                ["13.1 ຫຼັກຊັບຂາຍໂດຍມີສັນຍາຊື້ຄືນ", 0],
                ["14. ໜີ້ຕ້ອງສົ່ງທີ່ກຳເນີດຈາກການຈຳໜ່າຍຫຼັກຊັບ", 0],
                ["14.1 ເອກະສານຢັ້ງຢືນການກູ້ຢືມເງິນ", 0],
                ["14.2 ພັນທະບັດ ຫຼື ເງິນກູ້ທີ່ໄດ້ຈໍາໜ່າຍອອກ", 0],
                ["15. ໜີ້ສິນອື່ນໆ", report15["total"]],
                ["15.1 ດອກເບ້ຍ ແລະ ລາຍຈ່າຍອື່ນໆຄ້າງຈ່າຍ", report15["report_1"]],
                ["15.2 ບັນຊີພົວພັນລະຫວ່າງສຳນັກງານໃຫຍ່ກັບສາຂາ", 0],
                ["15.3 ອື່ນໆ", 0],
                ["16. ທຶນ ແລະ ຖືວ່າເປັນທຶນຂອງສະຖາບັນການເງິນ", report16["total"]],
                ["16.1 ທຶນຈົດທະບຽນ", report16["report_1"]],
                ["16.2 ສ່ວນເພີ່ມມູນຄ່າຮຸ້ນ", 0],
                ["16.3 ຄັງສຳຮອງຕາມກົດໝາຍ", report16["report_3"]],
                ["16.4 ຄັງຂະຫຍາຍທຸລະກິດສະຖາບັນການເງິນ", report16["report_4"]],
                ["16.5 ຄັງສຳຮອງອື່ນໆ", report16["report_5"]],
                ["16.6 ສ່ວນຜິດດ່ຽງຈາກການຕີມູນຄ່າຄືນໃໝ່", 0],
                ["16.7 ເງິນແຮຕາມຂໍ້ກຳນົດ (ເງິນແຮ່ຄ່າເຊື່ອມເງິນກູ້ປົກກະຕິ)", 0],
                ["16.8 ກຳໄລ-ຂາດທຶນສະສົມ (+/-)", 0],
                ["16.9 ຜົນໄດ້ຮັບລໍຖ້າຮັບຮອງ (+/-)", report16["report_9"]],
                ["16.10 ຜົນໄດ້ຮັບໃນປີ (+/-)", 0],
                ["16.11 ເງິນທຶນຊ່ວຍໜູນ ແລະ ທຶນທີ່ໄດ້ຈັດສັນ", report16["report_11"]],
                ["16.12 ໜີ້ຕ້ອງສົ່ງສຳຮອງ", 0],
                ["16.13 ເງິນຮຸ້ນສະມາຊິກຂອງ ສສງ", 0],
                [
                    "II. ໜີ້ສິນ ແລະ ທຶນທັງໝົດ = (11+12+13+14+15+16)",
                    assest_liability["total_liability"],
                ],
            ],
        }

        return JSONResponse(
            content=response_message(
                message="Successfully calculate the F2 report.",
                response_data=response_data,
                success=True,
            )
        )

    except Exception as e:
        return JSONResponse(
            content=response_message(
                message=f"An internal error occurred: {e}", success=False
            ),
            status_code=status.HTTP_500_INTERNAL_SERVER_ERROR,
        )
