from fastapi import APIRouter, Request, status
from fastapi.responses import JSONResponse
import pandas as pd
from services import F3

f3_route = APIRouter(prefix="/reports")


@f3_route.get("/f3")
def get_f3_report(req: Request):
    """
    Retrieve the F3 report based on the uploaded DataFrame.

    Returns:
        JSON response containing the F3 report data.
    """
    df_report: pd.DataFrame = getattr(req.app.state, "df_report", None)

    # Check if the DataFrame exists
    if df_report is None:
        return JSONResponse(
            content={"error": "No report available. Please upload the file first."},
            status_code=status.HTTP_404_NOT_FOUND,
        )

    f3 = F3(df_report)

    try:
        report1 = f3.first_report()

        report2 = f3.second_report()

        report9 = f3.nineth_report()

        report10 = f3.tenth_report()

        report15 = f3.fifteenth_report()

        report16 = f3.sixteenth_report()

        report17 = f3.seventeenth_report()

        report18 = f3.eigthteenth_report()

        report19 = f3.nineteenth_report()

        report21 = f3.twenty_first_report()

        summary = f3.summarize()

        response_data = {
            "index": list(range(86)),
            "columns": ["Item", "Amount (KIP)"],
            "data": [
                ["1. ລາຍຮັບດອກເບ້ຍ ແລະ ທີ່ຖືຄືວ່າດອກເບ້ຍ", report1["total"]],
                ["1.1 ລາຍຮັບຈາກການເຄື່ອນໄຫວລະຫວ່າງທະນາຄານ", report1["report_1"]],
                ["1.2 ລາຍຮັບຈາກການເຄື່ນໄຫວຈາກລູກຄ້າ", report1["report_2"]],
                ["1.3 ລາຍຮັບຈາກຫຼັກຊັບຊື້ໂດຍມີສັນຍາຂາຍຄືນ", 0],
                ["1.4 ລາຍຮັບຈາກການລົງທຶນໃນຫຼັກຊັບທີ່ໃຫ້ລາຍໄດ້ຄົງທີ່", 0],
                ["1.5 ລາຍດອກເບ້ຍ ແລະ ທີ່ຖືວ່າຄືດອກເບ້ຍອື່ນໆ", 0],

                ["2. ລາຍຈ່າຍດອກເບ້ຍ ແລະ ທີ່ຖືວ່າຄືດອກເບ້ຍ", report2["total"]],
                ["2.1 ລາຍຈ່າຍໃນການເຄື່ອນໄຫວລະຫວ່າງທະນາຄານ", report2["report_1"]],
                ["2.2 ລາຍຈ່າຍໃນການເຄື່ອນໄຫວກັບລູກຄ້າ", report2["report_2"]],
                ["2.3 ລາຍຈ່າຍໃນການຂາຍຫຼັກຊັບໂດຍມີສັນຍາຊື້ຄືນ", 0],
                ["2.4 ລາຍຈ່າຍໃນການຈຳໜ່າຍຮຸ້ນກູ້ ແລະ ໃບຢັ້ງຢືນກູ້ຢືມເງິນ", report2["report_4"]],
                ["2.5 ດອກເບ້ຍ ແລະ ທີ່ຖືວ່າຄືດອກເບ້ຍອື່ນໆ", 0],

                ["I. ລາຍຮັບຈາກດອກເບ້ຍສຸດທິ = (1-2)", summary["summary_1"]],

                ["3. ກຳໄລ ຫຼື ຂາດທຶນສຸດທິກ່ຽວກັບການຊື້ຂາຍຄໍາ (+/-)", 0],
                ["3.1 ລາຍຮັບທີ່ພົວພັນກັບວັດຖຸມີຄ່າ", 0],
                ["3.2 ລາຍຈ່າຍກ່ຽວກັບຄໍາ ແລະ ວັດຖຸມີຄ່າ", 0],

                ["4. ລາຍຮັບຈາກສິນເຊື່ອເຊົ່າຊື້ ແລະ ໃຫ້ເຊົ່າໂດຍມີທາງເລືອກຊື້", 0],
                ["4.1 ລາຍຮັບຈາກສິນເຊື່ອເຊົ່າຊື້້", 0],
                ["4.2 ກ່ຽວກັບສິນເຊື່ອເຊົ່າຊື້", 0],

                ["5. ລາຍຈ່າຍກ່ຽວກັບສິນເຊື່ອເຊົ່າຊື້ ແລະ ໃຫ້ເຊົ່າໂດຍມີທາງເລືອກຊື້ (-)", 0],
                [" 5.1 ລາຍຈ່າຍກ່ຽວກັບສິນເຊື່ອເຊົ່າຊື້ ", 0],

                ["6. ລາຍຮັບຈາກການໃຫ້ເຊົ່າທຳມະດາ", 0],
                ["6.1 ລາຍຮັບຈາກການໃຫ້ເຊົ່າທຳມະດາ", 0],
                ["6.2 ກ່ຽວກັບການໃຫ້ເຊົ່າທໍາມະດາ", 0],

                ["7. ລາຍຈ່າຍກ່ຽວກັບການໃຫ້ເຊົ່າທຳມະດາ (-)", 0],
                [" 7.1 ລາຍຈ່າຍກ່ຽວກັບການໃຫ້ເຊົ່າທຳມະດາ", 0],

                ["8. ລາຍຮັບເງິນປັນຜົນ", 0],
                ["8.1 ເງິນປັນຜົນ ແລະ ລາຍຮັບປະເພດດຽວກັນ", 0],
                ["8.2 ເງິນປັນຜົນຈາກເງິນໃຫ້ກູ້ຢຶມສໍາຮອງ", 0],

                ["9. ລາຍຮັບຄ່າທຳນຽມ ແລະ ຄ່າບໍລິການການເງິນ", report9["total"]],
                ["9.1 ລາຍຮັບຄ່າທຳນຽມທີ່ພົວພັນກັບການເຄື່ອນໄຫວລະຫວ່າງສະຖາບັນການເງິນ", 0],
                ["9.2 ລາຍຮັບຄ່າທຳນຽມທີ່ພົວພັນກັບການເຄື່ອນໄຫວກັບລູກຄ້າ", report9["report_2"]],
                ["9.3 ລາຍຮັບຄ່າທຳນຽມຕ່າງໆກ່ຽວກັບຫຼັກຊັບ ແລະ ເອກະສານອະນຸພັນ", 0],
                ["9.4 ລາຍຮັບຄ່າທຳນຽມໃນການແລກປ່ຽນເງິນຕາຕ່າງປະເທດ", 0],
                ["9.5 ລາຍຮັບຈາກການບໍລິການທາງດ້ານການເງິນ", 0],

                ["10. ລາຍຈ່າຍຄ່າທຳນຽມ ແລະ ຄ່າບໍລິການການເງິນ (-)", report10["total"]],
                [
                    "10.1 ລາຍຈ່າຍຄ່າທຳນຽມທີ່ພົວພັນກັບການເຄື່ອນໄຫວລະຫວ່າງສະຖາບັນການເງິນ",
                    report10["report_1"],
                ],
                ["10.2 ລາຍຈ່າຍຄ່າທຳນຽມທີ່ພົວພັນກັບການເຄື່ອນໄຫວກັບລູກຄ້າ", 0],
                ["10.3 ລາຍຈ່າຍຄ່າທຳນຽມຕ່າງໆກ່ຽວກັບຫຼັກຊັບ ແລະ ເອກະສານອະນຸພັນ", 0],
                ["10.4 ລາຍຈ່າຍຄ່າທຳນຽມໃນການແລກປ່ຽນເງິນຕາຕ່າງປະເທດ", 0],
                ["10.5 ລາຍຈ່າຍຈາກການບໍລິການທາງດ້ານການເງິນ", 0],

                ["11. ກຳໄລ ຫຼື ຂາດທຶນຈາກຫຼັກຊັບເພື່ອຄ້າ (+/-)", 0],
                ["11.1 ລາຍຮັບກ່ຽວກັບຫຼັກຊັບເພື່ອຄ້າ", 0],
                ["11.2 ລາຍຈ່າຍກ່ຽວກັບຫຼັກຊັບເພື່ອຄ້າ", 0],

                ["12. ກຳໄລ ຫຼື ຂາດທຶນຈາກຫຼັກຊັບຊື້ເພື່ອຂາຍ (+/-)", 0],
                ["12.1 ລາຍຮັບກ່ຽວກັບຂາຍຫຼັກຊັບຊື້ເພື່ອຂາຍ", 0],
                ["12.2 ລາຍຈ່າຍກ່ຽວກັບຂາຍຫຼັກຊັບຊື້ເພື່ອຂາຍ", 0],

                ["13. ກຳໄລ ຫຼື ຂາດທຶນຈາກການແລກປ່ຽນເງິນຕາຕ່າງປະເທດ (+/-)", 0],
                ["13.1 ກໍາໄລຈາກການແລກປ່ຽນເງິນຕາຕ່າງປະເທດ", 0],
                ["13.2 ຂາດທຶນຈາກການແລກປ່ຽນເງິນຕາຕ່າງປະເທດ", 0],

                ["14. ກຳໄລ ຫຼື ຂາດທຶນຈາກເຄື່ອງມືອະນຸພັນ (+/-)", 0],
                ["14.1 ລາຍຮັບທີ່ພົວພັນກັບເອກະສານອະນຸພັນ", 0],
                ["14.2 ລາຍຈ່າຍກ່ຽວກັບເອກະສານການເງິນມີກໍານົດ", 0],

                ["II. ລາຍຮັບສຸດທິໃນທຸລະກິດ = (I+3+4+5+6+7+8+9+10+11+12+13+14)", summary["summary_2"]],

                ["15. ລາຍຮັບອື່ນໆໃນທຸລະກິດ", report15["total"]],
                ["15.1 ລາຍຮັບຈາກຄໍາໝັ້ນສັນຍາດ້ານຫຼັກຊັບ ແລະ ຄໍາໝັ້ນສັນຍາອື່ນໆ", 0],
                ["15.2. ລາຍຮັບອື່ນໆຈາກການທຸລະກິດສະຖາບັນການເງິນ", report15["report_2"]],
                ["15.3 ລາຍຮັບສໍາຮອງ", report15["report_3"]],
                [
                    "15.4 ເກັບຄືນເງິນແຮລາຍຈ່າຍຄວາມສ່ຽງ, ເບ້ຍບໍານານ ແລະ ຕາມຂໍ້ກໍານົດ",
                    report15["report_4"],
                ],
                ["15.5 ລາຍ​ຮັບ​ບັງ​ເອີນ (ພິ​ເສດ)", 0],

                ["16. ລາຍຈ່າຍບໍລິຫານທົ່ວໄປ (-)", report16["total"]],
                ["16.1 ລາຍຈ່າຍກ່ຽວກັບພະນັກງານ ", report16["report_1"]],
                ["16.2 ລາຍຈ່າຍບໍລິຫານອື່ນໆ ", report16["report_2"]],

                ["17. ລາຍຈ່າຍຄ່າຫຼຸ້ຍຫ້ຽນ ແລະ ຄ່າເຊື່ອມມູນຄ່າ ຊ.ຄ.ທ (-)", report17["total"]],
                ["17.1 ຫຼັກຄ່າເຊື່ອມ ແລະ ຄ່າຫຼຸ້ຍຫ້ຽນມູນຄ່າຂອງຊັບສົມບັດຄົງທີ່", report17["report_1"]],
                ["17.2 ເກັບຄືນຄ່າເຊື່ອມມູນຄ່າຊັບສົມບັດຄົງທີ່", 0],

                ["18. ລາຍຈ່າຍອື່ນໆໃນການທຸລະກິດ (-)", report18["total"]],
                ["18.1 ລາຍຈ່າຍໃນທຸລະກິດສະຖາບັນການເງິນ", report18["report_1"]],
                ["18.2 ລາຍຈ່າຍສໍາຮອງອື່ນໆໃນທຸລະກິດ", report18["report_2"]],
                [
                    "18.3 ຫັກເງິນແຮຄ່າເຊື່ອມມູນຄ່າ ແລະ ຂາດທຶນບ້ວງໜີ້ຕ້ອງຮັບເກັບຄືນບໍ່ໄດ້",
                    report18["report_3"],
                ],
                ["18.4 ລາຍ​ຈ່າຍບັງ​ເອີນ (ພິ​ເສດ)", 0],

                [
                    "19. ສ່ວນການປ່ຽນແປງມູນຄ່າໜີ້ຕ້ອງຮັບ ແລະ ລາຍການນອກໃບສະຫຼຸບຊັບສົມບັດ (+/-)",
                    report19["total"],
                ],
                ["19.1 ຄ່າເຊື່ອມມູນຄ່າໜີ້ຕ້ອງຮັບ ແລະ ໜີ້ຕ້ອງ​ສົ່ງ", report19["report_1"]],
                ["19.2 ເກັບຄືນມູນຄ່າເຊື່ອມໜີ້ຕ້ອງຮັບ ແລະ ໜີ້ເສຍເກັບຄືນໄດ້", report19["report_2"]],

                ["20. ສ່ວນໄດ້ເສຍສຸດທິໃນການແປງມູນຄ່າຊັບສົມບັດຄົງທີ່ການເງິນ (+/-)", 0],
                ["20.1 ກໍາໄລຈາກການຂາຍ ຫຼື ສະສາງຊັບສົມບັດຄົງທີ່ການເງິນ", 0],
                ["20.2 ເກັບຄືນຄ່າເຊື່ອມມູນຄ່າຊັບສົມບັດຄົງທີ່ການເງິນ", 0],
                ["20.3 ຂາດທຶນຈາກການຂາຍ ຫຼື ສະສາງຊັບສົມບັດຄົງທີ່ການເງິນ", 0],
                ["20.4 ຫັກຄ່າເຊື່ອມມູນຄ່າຊັບສົມບັດຄົງທີ່ການເງິນ", 0],
                
                ["III. ລາຍຮັບ-ລາຍຈ່າຍປົກກະຕິ = (15+16+17+18+19+20)", summary["summary_3"]],
                ["IV. ຜົນໄດ້ຮັບກ່ອນອາ​ກອນ​ = (II-III)", summary["summary_4"]],

                ["21. ອາກອນ", report21["total"]],
                ["21.1 ອາກອນກຳໄລ", report21["report_1"]],
                ["21.2 ລາຍຈ່າຍອາກອນເຍື້ອນຊໍາລະ", 0],
                ["21.3 ລາຍຮັບອາກອນເຍື້ອນຊໍາລະ", 0],

                ["V. ຜົນໄດ້ຮັບສຸດທິໃນເດືອນ = (IV-21)", summary["summary_5"]],
            ],
        }

        return JSONResponse(content=response_data)

    except Exception as e:
        return JSONResponse(
            content={"error": f"An internal error occurred: {e}"},
            status_code=status.HTTP_500_INTERNAL_SERVER_ERROR,
        )
