from fastapi import APIRouter, Request, status
from fastapi.responses import JSONResponse
import pandas as pd
from services import F3

f3_route = APIRouter(prefix="/reports")

@f3_route.get("/f3")
async def get_f3_reports(req: Request):
    df_report: pd.DataFrame = getattr(req.app.state, "df_report", None)
    if df_report is None:
        return JSONResponse(
            content={"error": "No report available. Please upload the file first"},
            status_code=status.HTTP_404_NOT_FOUND,
        )

    f3 = F3(df_report)

    try:
        f3_report = f3.first_report()   
        total = f3_report['total'] 
        report_1 = f3_report['report_1']  
        report_2 = f3_report['report_2']  

        f3_report2 = f3.second_report()
        total_2 = f3_report2['total'] 
        report2_1 = f3_report2['report_1']  
        report2_2 = f3_report2['report_2']  
        report2_4 = f3_report2['report_4']

        f3_report9 = f3.nineth_report()
        total_9 = f3_report9['total'] 
        report9_2 = f3_report9['report_2']  

        f3_report10 = f3.tenth_report()
        total_10 = f3_report10['total'] 
        report10_1 = f3_report10['report_1']  

        f3_report15 = f3.fifteenth_report()
        total_15 = f3_report15['total'] 
        report15_2 = f3_report15['report_2']
        report15_3 = f3_report15['report_3']
        report15_4 = f3_report15['report_4']  

        f3_report16 = f3.sixteenth_report()
        total_16 = f3_report16['total'] 
        report16_1 = f3_report16['report_1']
        report16_2 = f3_report16['report_2']

        f3_report17 = f3.seventeenth_report()
        total_17 = f3_report17['total'] 
        report17_1 = f3_report17['report_1']

        f3_report18 = f3.eigthteenth_report()
        total_18 = f3_report18['total'] 
        report18_1 = f3_report18['report_1']
        report18_2 = f3_report18['report_2']
        report18_3 = f3_report18['report_3']


        f3_report19 = f3.nineteenth_report()
        total_19 = f3_report19['total'] 
        report19_1 = f3_report19['report_1']
        report19_2 = f3_report19['report_2']

        f3_report21 = f3.twenty_one_report()
        total_21 = f3_report21['total'] 
        report21_1 = f3_report21['report_1']

 

              
        
        response_data = {
            #"index": list(range(0 , 86)),
            "columns": ["ລາຍການ", "ຈໍານວນເງິນ (ກີບ)"],  
            "data": [
                 ["1. ລາຍຮັບດອກເບ້ຍ ແລະ ທີ່ຖືຄືວ່າດອກເບ້ຍ", total],
                 ["1.1 ລາຍຮັບຈາກການເຄື່ອນໄຫວລະຫວ່າງທະນາຄານ", report_1],
                 ["1.2 ລາຍຮັບຈາກການເຄື່ນໄຫວຈາກລູກຄ້າ", report_2],
                 ["1.3 ລາຍຮັບຈາກຫຼັກຊັບຊື້ໂດຍມີສັນຍາຂາຍຄືນ", 0],
                 ["1.4 ລາຍຮັບຈາກການລົງທຶນໃນຫຼັກຊັບທີ່ໃຫ້ລາຍໄດ້ຄົງທີ່", 0],
                 ["1.5 ລາຍດອກເບ້ຍ ແລະ ທີ່ຖືວ່າຄືດອກເບ້ຍອື່ນໆ", 0],

                 ["2. ລາຍຈ່າຍດອກເບ້ຍ ແລະ ທີ່ຖືວ່າຄືດອກເບ້ຍ",total_2],
                 ["2.1 ລາຍຈ່າຍໃນການເຄື່ອນໄຫວລະຫວ່າງທະນາຄານ", report2_1],
                 ["2.2 ລາຍຈ່າຍໃນການເຄື່ອນໄຫວກັບລູກຄ້າ", report2_2],
                 ["2.3 ລາຍຈ່າຍໃນການຂາຍຫຼັກຊັບໂດຍມີສັນຍາຊື້ຄືນ", 0],
                 ["2.4 ລາຍຈ່າຍໃນການຈຳໜ່າຍຮຸ້ນກູ້ ແລະ ໃບຢັ້ງຢືນກູ້ຢືມເງິນ", report2_4],
                 ["2.5 ດອກເບ້ຍ ແລະ ທີ່ຖືວ່າຄືດອກເບ້ຍອື່ນໆ",0],

                 ["3. ກຳໄລ ຫຼື ຂາດທຶນສຸດທິກ່ຽວກັບການຊື້ຂາຍຄໍາ (+/-)" , 0],
                 ["3.1 ລາຍຮັບທີ່ພົວພັນກັບວັດຖຸມີຄ່າ" , 0],
                 ["3.2 ລາຍຈ່າຍກ່ຽວກັບຄໍາ ແລະ ວັດຖຸມີຄ່າ" , 0],

                 ["4. ລາຍຮັບຈາກສິນເຊື່ອເຊົ່າຊື້ ແລະ ໃຫ້ເຊົ່າໂດຍມີທາງເລືອກຊື້ ",0],
                 ["4.1 ລາຍຮັບຈາກສິນເຊື່ອເຊົ່າຊື້້ ",0],
                 ["4.2 ກ່ຽວກັບສິນເຊື່ອເຊົ່າຊື້",0],

                 ["5. ລາຍຈ່າຍກ່ຽວກັບສິນເຊື່ອເຊົ່າຊື້ ແລະ ໃຫ້ເຊົ່າໂດຍມີທາງເລືອກຊື້ (-)",0],
                 ["5.1 ລາຍຈ່າຍກ່ຽວກັບສິນເຊື່ອເຊົ່າຊື້ ",0],

                 ["6. ລາຍຮັບຈາກການໃຫ້ເຊົ່າທຳມະດາ",0],
                 ["6.1 ລາຍຮັບຈາກການໃຫ້ເຊົ່າທຳມະດາ",0],
                 ["6.2 ກ່ຽວກັບການໃຫ້ເຊົ່າທໍາມະດາ",0],

                 ["7. ລາຍຈ່າຍກ່ຽວກັບການໃຫ້ເຊົ່າທຳມະດາ (-)",0],
                 [" 7.1 ລາຍຈ່າຍກ່ຽວກັບການໃຫ້ເຊົ່າທຳມະດາ  ",0],

                 ["8. ລາຍຮັບເງິນປັນຜົນ",0],
                 ["8.1 ເງິນປັນຜົນ ແລະ ລາຍຮັບປະເພດດຽວກັນ",0],
                 ["8.2 ເງິນປັນຜົນຈາກເງິນໃຫ້ກູ້ຢຶມສໍາຮອງ",0],

                 ["9. ລາຍຮັບຄ່າທຳນຽມ ແລະ ຄ່າບໍລິການການເງິນ",total_9],
                 ["9.2 ລາຍຮັບຄ່າທຳນຽມທີ່ພົວພັນກັບການເຄື່ອນໄຫວກັບລູກຄ້າ",report9_2],
                 ["9.3 ລາຍຮັບຄ່າທຳນຽມຕ່າງໆກ່ຽວກັບຫຼັກຊັບ ແລະ ເອກະສານອະນຸພັນ",0],
                 ["9.4 ລາຍຮັບຄ່າທຳນຽມໃນການແລກປ່ຽນເງິນຕາຕ່າງປະເທດ",0],
                 ["9.5 ລາຍຮັບຈາກການບໍລິການທາງດ້ານການເງິນ",0],

                 ["10. ລາຍຈ່າຍຄ່າທຳນຽມ ແລະ ຄ່າບໍລິການການເງິນ (-)",total_10],
                 ["10.2 ລາຍຈ່າຍຄ່າທຳນຽມທີ່ພົວພັນກັບການເຄື່ອນໄຫວກັບລູກຄ້າ",report10_1],
                 ["10.3 ລາຍຈ່າຍຄ່າທຳນຽມຕ່າງໆກ່ຽວກັບຫຼັກຊັບ ແລະ ເອກະສານອະນຸພັນ",0],
                 ["10.4 ລາຍຈ່າຍຄ່າທຳນຽມໃນການແລກປ່ຽນເງິນຕາຕ່າງປະເທດ",0],
                 ["10.5 ລາຍຈ່າຍຈາກການບໍລິການທາງດ້ານການເງິນ",0],

                 [" 11. ກຳໄລ ຫຼື ຂາດທຶນຈາກຫຼັກຊັບເພື່ອຄ້າ (+/-)",0],
                 ["11.1 ລາຍຮັບກ່ຽວກັບຫຼັກຊັບເພື່ອຄ້າ",0],
                 ["11.2 ລາຍຈ່າຍກ່ຽວກັບຫຼັກຊັບເພື່ອຄ້າ",0],

                 ["12. ກຳໄລ ຫຼື ຂາດທຶນຈາກຫຼັກຊັບຊື້ເພື່ອຂາຍ (+/-)",0],
                 ["12.1 ລາຍຮັບກ່ຽວກັບຂາຍຫຼັກຊັບຊື້ເພື່ອຂາຍ",0],
                 ["12.2 ລາຍຈ່າຍກ່ຽວກັບຂາຍຫຼັກຊັບຊື້ເພື່ອຂາຍ",0],

                 ["13. ກຳໄລ ຫຼື ຂາດທຶນຈາກການແລກປ່ຽນເງິນຕາຕ່າງປະເທດ",0],
                 ["13.1 ກໍາໄລຈາກການແລກປ່ຽນເງິນຕາຕ່າງປະເທດ",0],
                 ["13.2 ຂາດທຶນຈາກການແລກປ່ຽນເງິນຕາຕ່າງປະເທດ",0],

                 ["14. ກຳໄລ ຫຼື ຂາດທຶນຈາກເຄື່ອງມືອະນຸພັນ (+/-)",0],
                 ["14.1 ລາຍຮັບທີ່ພົວພັນກັບເອກະສານອະນຸພັນ",0],
                 ["14.2 ລາຍຈ່າຍກ່ຽວກັບເອກະສານການເງິນມີກໍານົດ",0],

                 ["15. ລາຍຮັບອື່ນໆໃນທຸລະກິດ",total_15],
                 ["15.1 ລາຍຮັບຈາກຄໍາໝັ້ນສັນຍາດ້ານຫຼັກຊັບ ແລະ ຄໍາໝັ້ນສັນຍາອື່ນໆ",0],
                 ["15.2. ລາຍຮັບອື່ນໆຈາກການທຸລະກິດສະຖາບັນການເງິນ",report15_2],
                 ["15.3 ລາຍຮັບສໍາຮອງ",report15_3],
                 ["15.4 ເກັບຄືນເງິນແຮລາຍຈ່າຍຄວາມສ່ຽງ, ເບ້ຍບໍານານ ແລະ ຕາມຂໍ້ກໍານົດ",report15_4],
                 ["15.5 ລາຍຮັບບັງເອີນ (ພິເສດ)",0],

                 [" 16. ລາຍຈ່າຍບໍລິຫານທົ່ວໄປ (-)",total_16],
                 [" 16.1 ລາຍຈ່າຍກ່ຽວກັບພະນັກງານ ",report16_1],
                 ["16.2 ລາຍຈ່າຍບໍລິຫານອື່ນໆ ",report16_2],

                 ["17. ລາຍຈ່າຍຄ່າຫຼຸ້ຍຫ້ຽນ ແລະ ຄ່າເຊື່ອມມູນຄ່າ ຊ.ຄ.ທ (-)",total_17],
                 ["17.1 ຫຼັກຄ່າເຊື່ອມ ແລະ ຄ່າຫຼຸ້ຍຫ້ຽນມູນຄ່າຂອງຊັບສົມບັດຄົງທີ່",report17_1],
                 ["17.2 ເກັບຄືນຄ່າເຊື່ອມມູນຄ່າຊັບສົມບັດຄົງທີ່",0],

                 ["18. ລາຍຈ່າຍອື່ນໆໃນການທຸລະກິດ (-)",total_18],
                 ["18.1 ລາຍຈ່າຍໃນທຸລະກິດສະຖາບັນການເງິນ",report18_1],
                 ["18.2 ລາຍຈ່າຍໃນທຸລະກິດສະຖາບັນການເງິນ",report18_2],
                 ["18.3 ຫັກເງິນແຮຄ່າເຊື່ອມມູນຄ່າ ແລະ ຂາດທຶນບ້ວງໜີ້ຕ້ອງສົ່ງສຳຮອງ",report18_3],
                 ["18.4 ລາຍ​ຈ່າຍບັງ​ເອີນ (ພິ​ເສດ)",0],

                 ["19. ສ່ວນການປ່ຽນແປງມູນຄ່າໜີ້ຕ້ອງຮັບ ແລະ ລາຍການນອກໃບສະຫຼຸບຊັບສົມບັດ (+/-)",total_19],
                 ["19.1 ຄ່າເຊື່ອມມູນຄ່າໜີ້ຕ້ອງຮັບ ແລະ ໜີ້ຕ້ອງ​ສົ່ງ",report19_1],
                 ["19.2 ເກັບຄືນມູນຄ່າເຊື່ອມໜີ້ຕ້ອງຮັບ ແລະ ໜີ້ເສຍເກັບຄືນໄດ້",report19_2],

                 ["20. ສ່ວນໄດ້ເສຍສຸດທິໃນການແປງມູນຄ່າຊັບສົມບັດຄົງທີ່ການເງິນ (+/-)",0],
                 ["20.1 ກໍາໄລຈາກການຂາຍ ຫຼື ສະສາງຊັບສົມບັດຄົງທີ່ການເງິນ",0],
                 ["20.2 ເກັບຄືນຄ່າເຊື່ອມມູນຄ່າຊັບສົມບັດຄົງທີ່ການເງິນ",0],
                 ["20.3 ຂາດທຶນຈາກການຂາຍ ຫຼື ສະສາງຊັບສົມບັດຄົງທີ່ການເງິນ",0],
                 ["20.4 ຫັກຄ່າເຊື່ອມມູນຄ່າຊັບສົມບັດຄົງທີ່ການເງິນ",0],

                 ["21. ອາກອນ",total_21],
                 ["21.1 ລາຍຮັບອາກອນເຍື້ອນຊໍາລະ",report21_1],
                 ["21.2 ລາຍຈ່າຍອາກອນເຍື້ອນຊໍາລະ",0],
                 ["21.3 ລາຍຮັບອາກອນເຍື້ອນຊໍາລະ",0],


            
            ]
        }

        return JSONResponse(content=response_data)

    except Exception as e:
        print("Error occurred:", str(e))  # Log the error message
        return JSONResponse(
            content={"error": "An internal error occurred", "details": str(e)},
            status_code=status.HTTP_500_INTERNAL_SERVER_ERROR
        )